---
kind: property
id: P:Autodesk.Revit.DB.LineSegment.EndParameter
source: html/9a3656de-d950-4bd5-4efe-fc7ea4c5c934.htm
---
# Autodesk.Revit.DB.LineSegment.EndParameter Property

Parameter associated with the end point.

## Syntax (C#)
```csharp
public double EndParameter { get; }
```